Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Now let's add the simple web page to interact with our `BookResource`. Quarkus automatically serves static resources contained in the `META-INF/resources` directory. In the `src/main/resources/META-INF/resources` directory, replace the `index.html` file with the content from this {quickstarts-blob-url}/validation-quickstart/src/main/resources/META-INF/resources/index.html[index.html] file in it.
ja_jp: それでは、 `BookResource`.Quarkusと対話するためのシンプルなウェブページを追加してみましょう。Quarkusは、 `META-INF/resources` ディレクトリーに含まれる静的リソースを自動的に提供します。 `src/main/resources/META-INF/resources` ディレクトリーで、 `index.html` ファイルをこの {quickstarts-blob-url}/validation-quickstart/src/main/resources/META-INF/resources/index.html[index.html] ファイルの内容で置き換えます。

source: Now let's assume that we have the following tests:
ja_jp: ここで、次のテストがあると仮定します。

source: Now let's build our runnable jar:
ja_jp: それでは、実行可能なjarをビルドしてみましょう。

source: Now let's build the application as a native executable and run the tests:
ja_jp: それでは、アプリケーションをネイティブ実行可能ファイルとしてビルドし、テストを実行してみましょう:

source: Now let's check `FrontendResource` methods which do not propagate the existing tokens but use `OidcClient` to acquire and propagate the tokens. You have seen that `OidcClient` is configured to acquire the tokens for the `alice` user, so:
ja_jp: ここで、既存のトークンは伝播しないが、 `OidcClient` を使用してトークンを取得および伝播する `FrontendResource` メソッドを見てみましょう。 `OidcClient` は `alice` ユーザーのトークンを取得するように設定されています。

source: Now let's complete creating the application with adding `FrontendResource`:
ja_jp: それでは、 `FrontendResource` を追加して、アプリケーションの作成を完了しましょう。

source: Now let's consider a more complicated example:
ja_jp: では、もう少し複雑な例を考えてみましょう。

source: Now let's consume the quote request and give out a price. Inside the _processor_ project, create the `src/main/java/org/acme/kafka/processor/QuotesProcessor.java` file and add the following content:
ja_jp: ここでは、見積りリクエストを使用して価格を提示します。_プロセッサー_ プロジェクト内に、 `src/main/java/org/acme/kafka/Processor/QuotesProcessor.java` ファイルを作成し、次のコンテンツを追加します。

source: Now let's consume the quote request and give out a price. Inside the _processor_ project, create the `src/main/java/org/acme/pulsar/processor/QuotesProcessor.java` file and add the following content:
ja_jp: ここでは、見積りリクエストを使用して価格を提示します。_プロセッサー_ プロジェクト内に、 `src/main/java/org/acme/pulsar/processor/QuotesProcessor.java` ファイルを作成し、次のコンテンツを追加します。

source: Now let's consume the quote request and give out a price. Inside the `processor` project, locate the `src/main/java/org/acme/amqp/processor/QuoteProcessor.java` file and add the following:
ja_jp: ここでは、見積りリクエストを使用して価格を提示します。 `processor` プロジェクト内で、 `src/main/java/org/acme/amqp/processor/QuoteProcessor.java` ファイルを見つけ、以下を追加します。

source: Now let's consume the quote request and give out a price. Inside the `processor` project, locate the `src/main/java/org/acme/rabbitmq/processor/QuoteProcessor.java` file and add the following:
ja_jp: それでは、見積依頼を消費して、価格を出してみましょう。 `processor` プロジェクト内で、 `src/main/java/org/acme/rabbitmq/processor/QuoteProcessor.java` ファイルを探し、以下を追加します:

source: Now let's create a `FruitService` that will be the business layer of our application and store/load the fruits from the Cassandra database.
ja_jp: ここで、アプリケーションのビジネス層となる `FruitService` を作成し、Cassandraデータベースから果物をセーブ/ロードします。

source: Now let's create a `LegumeResource` REST service with only one method that returns the list of legumes.
ja_jp: それでは、マメ科植物のリストを返すメソッドを 1 つだけ持つ `LegumeResource` REST サービスを作成してみましょう。

source: Now let's create a `LegumeResource` REST service with only one method which returns the list of legumes.
ja_jp: それでは、マメ科植物のリストを返すメソッドを一つだけ持つ `LegumeResource` REST サービスを作成してみましょう。

source: Now let's create a resource class which returns an HTML form and handles form POST requests:
ja_jp: では、HTMLフォームを返し、フォームのPOSTリクエストを処理するリソースクラスを作成しましょう:

source: Now let's create an application in your account and deploy that repository to it:
ja_jp: 続いて、アカウントでアプリケーションを作成し、そのリポジトリーをそこにデプロイしてみましょう。

source: Now let's declare and use this template in the resource class.
ja_jp: 次に、このテンプレートをリソースクラスで宣言して使用してみましょう。

source: Now let's declare and use those templates in the resource class.
ja_jp: では、これらのテンプレートをリソースクラスで宣言して使ってみましょう。

source: Now let's dive deeper into the great Qute features introduced in the 1.10.0 release.
ja_jp: それでは、1.10.0リリースで導入された素晴らしいQuteの機能について、さらに深く掘り下げてみましょう。

source: Now let's inject the "compiled" template in the resource class.
ja_jp: では、リソースクラスに「コンパイル済み」テンプレートを注入してみましょう。

source: Now let's run our application via Quarkus dev mode:
ja_jp: それでは、Quarkusの開発モードでアプリケーションを実行してみましょう:

source: Now let's use this to make a secured request to the /secured/roles-allowed endpoint. Make sure you have the Quarkus server still running in dev mode, and then run the following command, making sure to use your version of the generated JWT from the previous step:
ja_jp: これを使用して、/secured/roles-allowed エンドポイントにセキュリティーで保護されたリクエストを作成しましょう。Quarkus サーバーが引き続き開発モードで実行されていることを確認してから、次のコマンドを実行し、前の手順で生成された自分の JWT バージョンを使用していることを確認します。

source: Now let's use this to make a secured request to the `/secured/roles-allowed` endpoint
ja_jp: これを使って `/secured/roles-allowed` エンドポイントにセキュアなリクエストをしてみましょう

source: Now let's walk users through adding a test to their application:
ja_jp: 次に、アプリケーションにテストを追加する手順をユーザーに説明しましょう。

source: Now logout directly from OIDC Dev UI and login as a new user - add more users to the registered Auth0 application if required.
ja_jp: 次に、OIDC Dev UI から直接ログアウトし、新しいユーザーとしてログインします。必要に応じて、登録済みの Auth0 アプリケーションにさらにユーザーを追加します。

source: Now make sure you select your project in the top selector, and click on the left-hand bar menu on `APIs and Services > OAuth consent screen`:
ja_jp: 次に、トップセレクターでプロジェクトを選択し、左側のメニューバーから `APIs and Services > OAuth consent screen` をクリックします。

source: Now modify `GreetingResource` to start using the `GreetingProperties`:
ja_jp: そして、 `GreetingProperties` を使い始めるよう `GreetingResource` を修正します。

source: Now open the main link:http://localhost:8080/q/dev[Dev UI page] and you will see the `OpenID Connect Card` linking to a `Keycloak` page:
ja_jp: 次に link:http://localhost:8080/q/dev[Dev UI] のメインページを開くと、 `OpenID Connect Card` が `Keycloak` ページにリンクしているのがわかります:

source: Now open the main link:http://localhost:8080/q/dev[Dev UI page], and you will see the `OpenID Connect Card` linking to a Keycloak page:
ja_jp: 次に、メインの link:http://localhost:8080/q/dev[Dev UI ページ] を開くと、 `OpenID Connect Card`が Keycloak のページにリンクしているのが確認できます。

source: Now press `Continue`:
ja_jp: 続いて `Continue` を押します。

source: Now press `Done`:
ja_jp: 次に `Done` を押します。

source: Now press `Register`:
ja_jp: 次に、 `Register` を押します。

source: Now press `Save`:
ja_jp: 次に、 `Save` を押します。

source: Now run an instance of the _debezium/tooling_ image, attaching to the same network all the other containers run in. This image provides several useful tools such as _kafkacat_ and _httpie_:
ja_jp: ここで _debezium/tooling_ イメージのインスタンスを実行し、他のすべてのコンテナーが実行しているのと同じネットワークにアタッチします。このイメージは、 _kafkacat_ や _httpie_ などの便利なツールを提供しています。

source: Now start Docker Compose as described above (don't forget to rebuild the container images).
ja_jp: ここで、上記のようにDocker Composeを起動します(コンテナーイメージのリビルドを忘れずに)。

source: Now start Quarkus in dev mode with:
ja_jp: ここで、開発モードで Quarkus を起動します。

source: Now stop the `aggregator` service again and rebuild it. Then let's spin up three instances of it:
ja_jp: ここで再び `aggregator` サービスを停止してリビルドします。そして、3つのインスタンスを起動してみましょう。

source: Now that Vault knows how to create users in RabbitMQ, we need to configure Quarkus to use a credentials-provider for RabbitMQ.
ja_jp: これで Vault は RabbitMQ でユーザーを作成する方法を把握したため、RabbitMQ のクレデンシャルプロバイダーを使用するように Quarkus を設定する必要があります。

source: Now that everything is explained, we can start coding!
ja_jp: これで全てが説明されたので、さっそくコーディングに取り掛かりましょう

source: Now that is unexpected, why is it returning `hello null` and not `hello quarkus`?
ja_jp: 予想に反し、 `hello quarkus` ではなく `hello null` が返却されます。この理由は何でしょうか？

source: Now that our authors are indexed, we will want to map books, so that this `@IndexedEmbedded` annotation actually embeds _something_.
ja_jp: author のインデックスが作成されたので、この `@IndexedEmbedded` アノテーションが 実際に _何か_ を含むように、book をマッピングします。

source: Now that our books are indexed, we can do the same for the authors.
ja_jp: `Book` がインデックス化されたことで、 `Author` にも同じことができるようになりました。

source: Now that the REST endpoint is running, we can access it using a command line tool like curl:
ja_jp: REST エンドポイントが実行されているので、curl のようなコマンドラインツールを使ってアクセスできます:

source: Now that the REST endpoint is running, you can access it by using a command line tool such as curl:
ja_jp: REST エンドポイントが実行されているので、curl などのコマンドラインツールを使用してアクセスできます。

source: Now that the application is running, you can test the REST service. You can use any REST client you wish. The following example uses the Linux command `curl` to send a POST request:
ja_jp: これでアプリケーションが実行されたため、REST サービスをテストできます。任意の REST クライアントを使用できます。次の例では、Linux コマンド `curl` を使用して POST 要求を送信します。

source: Now that the cache was loaded during the previous call, try calling the same URL. This time, you should get a super fast answer with an `executionTimeInMs` value close to 0.
ja_jp: 前回の呼び出しでキャッシュが読み込まれたので、同じ URL を呼び出してみてください。今度は、 `executionTimeInMs` の値が 0 に近い超高速な応答が返ってくるはずです。

source: Now that the service is located, we need to select the _best_ instance. For example, you can use the least-response-time load-balancer implementation. This selection strategy monitors the interactions and selects the fastest instance to improve the response time.
ja_jp: サービスの特定が完了したので、 _最適な_ インスタンスを選択する必要があります。たとえば、最小応答時間のロードバランサーの実装を利用することができます。この選択戦略は、インタラクションを監視し、応答時間を改善するために最速のインスタンスを選択します。

source: Now that we are done with the scaffolding, let's think a bit about what we want to achieve: we need to find all the classes in a given package whose name ends with `MessageTransformer`.
ja_jp: これでスキャフォールド（足場）ができたので、何を実現したいかを少し考えてみましょう。あるパッケージの中で、名前が `MessageTransformer` で終わるクラスをすべて見つける必要があります。

source: Now that we can generate a JWT to access our secured REST endpoints, let's see what more we can do with the `JsonWebToken` interface and the JWT claims. The `org.eclipse.microprofile.jwt.JsonWebToken` interface extends the `java.security.Principal` interface, and is in fact the type of the object that is returned by the `jakarta.ws.rs.core.SecurityContext#getUserPrincipal()` call we used previously. This means that code that does not use CDI but does have access to the REST container `SecurityContext` can get hold of the caller `JsonWebToken` interface by casting the `SecurityContext#getUserPrincipal()`.
ja_jp: さて、安全なRESTエンドポイントにアクセスするためにJWTを生成できるようになったので、 `JsonWebToken` インターフェースとJWTクレームを使ってさらに何ができるかを見てみましょう。 `org.eclipse.microprofile.jwt.JsonWebToken` インターフェースは `java.security.Principal` インターフェースを拡張したもので、実際には前回使用した `jakarta.ws.rs.core.SecurityContext#getUserPrincipal()` 呼び出しによって返されるオブジェクトの型です。つまり、CDIを使用せず、RESTコンテナ `SecurityContext` にアクセスできるコードは、 `SecurityContext#getUserPrincipal()` をキャストすることで、呼び出し元の `JsonWebToken` インターフェースを取得することができます。

source: Now that we can generate a JWT to access our secured REST endpoints, let's see what more we can do with the `JsonWebToken` interface and the JWT claims. The `org.eclipse.microprofile.jwt.JsonWebToken` interface extends the `java.security.Principal` interface, and is in fact the type of the object that is returned by the `javax.ws.rs.core.SecurityContext#getUserPrincipal()` call we used previously. This means that code that does not use CDI but does have access to the REST container `SecurityContext` can get hold of the caller `JsonWebToken` interface by casting the `SecurityContext#getUserPrincipal()`.
ja_jp: 保護された REST エンドポイントにアクセスするための JWT を生成できるようになったので、 `JsonWebToken` インターフェイスと JWT クレームでさらに何ができるかを見てみましょう。 `org.eclipse.microprofile.jwt.JsonWebToken` インターフェイスは `java.security.Principal` インターフェイスを拡張します。実際、これは 前に使用した `javax.ws.rs.core.SecurityContext#getUserPrincipal()` 呼び出しにより返されるオブジェクトのタイプです。これは、CDI は使用しないが、REST コンテナー `SecurityContext` にアクセスできるコードは、 `SecurityContext#getUserPrincipal()` をキャストすることで、呼び出し元の `JsonWebToken` インターフェイスを取得できることを意味します。

source: Now that we have enabled JMX on our Quarkus application and redeployed it, it is ready to talk to Cryostat. Before this can happen, however, Cryostat needs to know how and where to find the application. There are two ways to achieve this: automatic discovery and custom targets. Automatic discovery is the preferred method and is enabled by default. Custom targets can be used to fill in gaps for deployed application targets that do not meet the criteria for automatic discovery, but which are known to be reachable over the network.
ja_jp: QuarkusアプリケーションでJMXを有効にし、再デプロイしたので、Cryostatと通信する準備ができました。しかし、これが実現する前に、Cryostatはアプリケーションをどこでどのように見つけるかを知る必要があります。これを達成するために、自動検出とカスタムターゲットの2つの方法があります。自動検出は好ましい方法であり、デフォルトで有効になっています。カスタムターゲットは、自動検出の基準を満たさないが、ネットワーク上で到達可能であることが知られている展開されたアプリケーションターゲットのギャップを埋めるために使用することができます。

source: Now that we have implemented our services, we need to register them into Consul.
ja_jp: サービスの実装が完了したので、Consulに登録する必要があります。

source: Now that we have made the extension configurable for the extension users by adding _application.properties_ entries, exposing the extension name and providing the configurations to the handler class which creates the AWS CloudWatch objects needed to put log messages in AWS CloudWatch, we only need to add one missing piece. The Log Handler itself. In the snippet above, in the _LoggingCloudWatchHandlerValueFactory_ we created it already and returned it as a RuntimeValue which we are using in the _LoggingCloudwatchProcessor_ class. That’s the call chain needed to overwrite the existing default log handler.
ja_jp: さて、 _application.properties_エントリーを追加し、エクステンション名を公開し、ログ・メッセージをAWS CloudWatchに置くために必要なAWS CloudWatchオブジェクトを作成するハンドラー・クラスに設定を提供することで、エクステンションのユーザーが設定できるようにしたので、あとは足りない部分を1つ追加するだけです。ログハンドラー自体です。上のスニペットでは、 _LoggingCloudWatchHandlerValueFactory_で、すでに作成し、 _LoggingCloudwatchProcessor_クラスで使用しているRuntimeValueとして返しています。これが、既存のデフォルトログハンドラを上書きするために必要なコールチェーンです。

source: Now that we have managed to use OIDC authorization code flow and used both ID token and UserInfo to access the user information, the next typical task is to propagate the current Auth0 access token to access the downstream service on behalf of the currently authenticated user.
ja_jp: OIDC 認可コードフローを使用し、ID トークンと UserInfo の両方を使用してユーザー情報にアクセスできるようになりました。一般的な次のタスクは、現在の Auth0 アクセストークンを伝播して、現行の認証済みユーザー代わってダウンストリームサービスにアクセスすることです。

source: Now that we have our classes indexed, we want to make them CDI beans.
ja_jp: クラスのインデックスができたので、CDI Beanにしてみましょう。

source: Now that we have our service container images available in a public registry, we need to deploy them into the Kubernetes cluster.
ja_jp: パブリックレジストリーでサービスコンテナーイメージを使用できるようになりました。次に、それらを Kubernetes クラスターにデプロイする必要があります。

source: Now that we have the client instance properly configured, we need a way to have it perform something when we start the application. For that, we will use a REST endpoint that, when called by a user, obtains the client instance and lets it execute the query.
ja_jp: クライアントインスタンスが適切に設定されたので、アプリケーションの起動時にクライアントインスタンスに何かを実行させる方法が必要になります。そのために、RESTエンドポイントを使用します。ユーザーが呼び出すと、クライアントインスタンスを取得して、クエリを実行させます。

source: Now that we have the generated classes let's implement our _hello_ service.
ja_jp: 生成されたクラスができたので、 _hello_ サービスを実装してみましょう。

source: Now that we have the list of methods handy, the next step is to remove them.
ja_jp: これでメソッドのリストが手元に揃ったので、次のステップではメソッドを削除します。

source: Now that we have the model classes, we can create the interface that represents the actual set of operations we want to call on the remote GraphQL service.
ja_jp: モデルクラスができたので、次は、リモートのGraphQLサービスを呼び出すための実際の操作セットを表すインターフェースを作成します。

source: Now that we know how to create, update and delete our entities, let's see how we can query our database to find them, or even run delete queries.
ja_jp: エンティティの作成、更新、削除の方法がわかったので、データベースをクエリしてエンティティを検索する方法や、削除クエリを実行する方法を見てみましょう。

source: Now that you can generate a JWT to access our secured REST endpoints, let's see what more you can do with the `JsonWebToken` interface and the JWT claims. The `org.eclipse.microprofile.jwt.JsonWebToken` interface extends the `java.security.Principal` interface, and is the object type returned by the `jakarta.ws.rs.core.SecurityContext#getUserPrincipal()` call you used previously. This means that code that does not use CDI but does have access to the REST container `SecurityContext` can get hold of the caller `JsonWebToken` interface by casting the `SecurityContext#getUserPrincipal()`.
ja_jp: これで、セキュリティー保護された REST エンドポイントにアクセスするための JWT を生成できるようになりました。次に、 `JsonWebToken` インターフェイスと JWT クレームを使用して何ができるかを見てみましょう。 `org.eclipse.microprofile.jwt.JsonWebToken` インターフェイスは `java.security.Principal` インターフェイスを継承し、以前に使用した `jakarta.ws.rs.core.SecurityContext#getUserPrincipal()` 呼び出しによって返されるオブジェクトタイプです。 つまり、CDI を使用しくても REST コンテナー `SecurityContext` にアクセスできるコードは、 `SecurityContext#getUserPrincipal()` をキャストすることで、呼び出し元の `JsonWebToken` インターフェイスを取得できます。

source: Now that you have disabled redirects for the SPA, you must log in and log out programmatically from your client. Below are examples of JavaScript methods for logging into the `j_security_check` endpoint and logging out of the application by destroying the cookie.
ja_jp: SPA のリダイレクトを無効にしたので、クライアントからプログラムによってログインおよびログアウトする必要があります。 以下は、 `j_security_check` エンドポイントにログインし、Cookie を破棄してアプリケーションからログアウトするための JavaScript メソッドの例です。

source: Now that you have generated the configuration reference documentation for your extension, you need to include it in your guide (and review it).
ja_jp: これで、あなたのエクステンションの設定参照ドキュメントが生成されたので、それをガイドに含める必要があります (そして、それをレビューする必要があります)。

source: Now that you have recorded the creation of a service during the build phase, you need to record how to start the service at runtime during booting. You do this with a RUNTIME_INIT build step as shown in the `TestProcessor#startRuntimeService` method.
ja_jp: ビルドフェーズでのサービスの作成を記録したので、起動時にランタイムでサービスを開始する方法を記録する必要があります。これは、 `TestProcessor#startRuntimeService` メソッドに示されている RUNTIME_INIT ビルドステップを使用して行います。

source: Now that you have successfully created and configured your Auth0 application, you are ready to start creating and configuring a Quarkus endpoint. In the steps that follow, you will continue to configure and update the Auth0 application as well.
ja_jp: これで Auth0 アプリケーションの作成と設定が完了しました。次は、Quarkus エンドポイントの作成と設定を行います。 その後、Auth0 アプリケーションの設定と更新を行います。

source: Now that you have successfully run and tested the security quick start project, you are ready to explore more security features of Quarkus Security and the JPA identity store.
ja_jp: セキュリティクイックスタートプロジェクトの実行とテストに成功したので、Quarkus SecurityとJPA IDストアのセキュリティ機能を理解していくための準備ができました。

source: Now that you have the users signing in to Quarkus with the help of Auth0, you probably want to support a user-initiated logout. Quarkus supports https://quarkus.io/guides/security-oidc-code-flow-authentication#logout-and-expiration[RP-initiated and other standard OIDC logout mechanisms, as well as the local session logout].
ja_jp: これで、ユーザーは Auth0 を使用して Quarkus にサインインできるようになりました。次は、ユーザー主導のログアウトのサポートが必要になるのではないでしょうか。Quarkus は、 https://quarkus.io/guides/security-oidc-code-flow-authentication#logout-and-expiration[RP-initiatedおよび他の標準的な OIDC ログアウトメカニズム、およびローカルセッションログアウト] をサポートしています。

source: Now that you just finished building your first extension you should be eager to use it in a Quarkus application!
ja_jp: 最初のエクステンションを構築し終えたばかりなので、Quarkus アプリケーションで使いたいと思うことでしょう。

source: Now that you just finished building your first extension, you should be eager to use it in a Quarkus application!
ja_jp: 初めてのエクステンションのビルドを終えたばかりなので、Quarkus アプリケーションでそれを使うことに熱心になるでしょう。

source: Now that your Quarkus application is up and running, let's tremendously improve its response time by caching the external meteorological service responses. Update the `WeatherForecastService` class as follows:
ja_jp: Quarkusアプリケーションが稼働しているので、外部の気象サービスのレスポンスをキャッシュすることで、レスポンスタイムを大幅に改善してみましょう。 `WeatherForecastService` クラスを以下のように更新します:

source: Now that your Quarkus application is up and running, let's tremendously improve its response time by caching the external meteorological service responses. Update the `WeatherForecastService` class like this:
ja_jp: Quarkusアプリケーションが動いたので、外部の気象サービスのレスポンスをキャッシュすることで、レスポンスタイムを大幅に改善してみましょう。 `WeatherForecastService` クラスを次のように修正します。

source: Now that your service uses a certificate issued by OpenShift, configure your client applications to trust this certificate. To do so, create a ConfigMap that holds the CA certificate, and then configure the pod to mount it. The following steps use a Quarkus REST client as an example, but the same approach applies to any client.
ja_jp: サービスが OpenShift によって発行された証明書を使用するようになったら、この証明書を信頼するようにクライアントアプリケーションを設定します。 これを行うには、CA 証明書を保持する ConfigMap を作成し、それをマウントするように Pod を設定します。 次の手順では、Quarkus REST クライアントを例として使用しますが、どのクライアントでも同じ方法が使用されます。

source: Now the `GET /fruits` will accept three new query parameters: `sort`, `page` and `size`.
ja_jp: これで `GET /fruits` は、 `sort` 、 `page` 、 `size` という3つの新しいクエリパラメータを受け付けるようになりました。

source: Now the external database will be used in prod mode, and Dev Services will be used in dev and test modes.
ja_jp: これで外部データベースが本番モードで使用されるようになり、 Dev Services が開発モードとテストモードで使用されるようになります。

source: Now try adding database and UI integration:
ja_jp: 次に、データベースと UI の統合を追加しましょう。

source: Now update `ApiEchoService` to enforce Permission Based Access Control:
ja_jp: ここで、権限ベースのアクセス制御を適用するように、 `ApiEchoService` を更新します。

source: Now update the generated application so that the hello method will execute in the context of a Long Running Action:
ja_jp: ここで、生成されたアプリケーションを更新し、HelloメソッドがLong Running Actionのコンテキストで実行されるようにします。

source: Now update the test code like this:
ja_jp: 次に、テストコードを以下のように更新します。

source: Now use this token to call `/frontend/user-name-with-propagated-token` and `/frontend/admin-name-with-propagated-token`:
ja_jp: このトークンを使用して、 `/frontend/user-name-with-propagated-token` と `/frontend/admin-name-with-propagated-token` を呼び出します。

source: Now using your favorite editor or IDE, update `ReactiveGreetingResource.kt` and change the `hello` method to the following:
ja_jp: ここで、お好きなエディタやIDEを使って、 `ReactiveGreetingResource.kt` をアップデートし、 `hello` のメソッドを以下のように変更します:

source: Now visit the GraphQL UI page that has been deployed in `dev` mode.
ja_jp: それでは、 `dev` モードでデプロイされたGraphQL UIページにアクセスしてみましょう。

source: Now visit the GraphiQL page that has been deployed in `dev` mode.
ja_jp: それでは、 `dev` モードで展開されたGraphiQLページにアクセスしてみましょう。

source: Now we are ready to run our application with the new settings. We launch the application with JFR configured so that it is enabled from the startup of the Java Virtual Machine.
ja_jp: これで、新しい設定でアプリケーションを実行する準備が整いました。 Java 仮想マシンの起動から JFR が有効になるように設定されたアプリケーションを起動します。

source: Now we are ready to run our application. If using `application.properties` to configure the tracer:
ja_jp: これでアプリケーションを実行する準備が整いました。トレーサーの設定に `application.properties` を使用している場合:

source: Now we are ready to run our application. We can launch the application with JFR configured to be enabled from the startup of the Java Virtual Machine.
ja_jp: これでアプリケーションを実行する準備が整いました。 Java 仮想マシンの起動から JFR が有効化されるように設定されたアプリケーションを起動できます。

source: Now we are ready to run our application. Use:
ja_jp: これで、アプリケーションを実行する準備が整いました。次を実行してください:

source: Now we are ready to run our application:
ja_jp: ここまでで、アプリケーションを実行する準備が整いました。

source: Now we can allow clients to query for all characters, not just heroes.
ja_jp: これで、クライアントがヒーローだけでなく、すべてのキャラクターをクエリできるようになりました。

source: Now we can build again:
ja_jp: ではまたビルドしてみましょう:

source: Now we can check that the codestart actually works by creating a project consuming our extension (make sure the snapshot version is correct):
ja_jp: これで、エクステンションを使用するプロジェクトを作成して、Codestart が実際に機能することを確認できます (スナップショットのバージョンが正しいことを確認してください)。
